In [1]:
import pandas as pd
import numpy as np

In [16]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [10]:
# NaN 값은 세지 않음
s.count()

9

In [11]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [16]:
# 각 열마다 별도로 데이터 갯수를 센다. 데이터에서 값이 누락된 부분을 찾을 때 유용하다.
df.count()

0    4
1    4
2    4
3    3
dtype: int64

### 연습 문제 4.2.5
--------------

다음 명령으로 타이타닉호 승객 데이터를 데이터프레임으로 읽어온다. 이 명령을 실행하려면 seaborn 패키지가 설치되어 있어야 한다.

```python
import seaborn as sns

titanic = sns.load_dataset("titanic")
```
타이타닉호 승객 데이터의 데이터 값을 각 열마다 구해본다.

In [4]:
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic["age"][:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [8]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100)+1)
s2.tail()

95    5
96    6
97    3
98    5
99    4
dtype: int32

In [9]:
s2.value_counts()

2    22
1    18
5    17
6    16
4    14
3    13
dtype: int64

In [12]:
# 데이터프레임에는 value_counts 메서드가 없으므로 각 열마다 별도로 적용해야 한다.
df[0].value_counts()

3.0    2
4.0    1
0.0    1
Name: 0, dtype: int64

In [14]:
s2.value_counts().sort_index()

1    18
2    22
3    13
4    14
5    17
6    16
dtype: int64

In [18]:
s.sort_values().sort_index()

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [19]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [27]:
df.sort_values(by=[0,3])

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0


### 연습 문제 4.2.6
-----------
타이타닉호 승객중 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [41]:
print(titanic["sex"].value_counts())
print(titanic["age"].value_counts().sort_index())
print(titanic["class"].value_counts())
print(titanic["alive"].value_counts())

male      577
female    314
Name: sex, dtype: int64
0.42      1
0.67      1
0.75      2
0.83      2
0.92      1
1.00      7
2.00     10
3.00      6
4.00     10
5.00      4
6.00      3
7.00      3
8.00      4
9.00      8
10.00     2
11.00     4
12.00     1
13.00     2
14.00     6
14.50     1
15.00     5
16.00    17
17.00    13
18.00    26
19.00    25
20.00    15
20.50     1
21.00    24
22.00    27
23.00    15
         ..
44.00     9
45.00    12
45.50     2
46.00     3
47.00     9
48.00     9
49.00     6
50.00    10
51.00     7
52.00     6
53.00     1
54.00     8
55.00     2
55.50     1
56.00     4
57.00     2
58.00     5
59.00     2
60.00     4
61.00     3
62.00     4
63.00     2
64.00     2
65.00     3
66.00     1
70.00     2
70.50     1
71.00     2
74.00     1
80.00     1
Name: age, Length: 88, dtype: int64
Third     491
First     216
Second    184
Name: class, dtype: int64
no     549
yes    342
Name: alive, dtype: int64

In [59]:
titanic[titanic["age"] < 1]
titanic.index.name = "number"
titanic.columns.name = "분류"

In [61]:
titanic.head()

분류,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
number,,,,,,,,,,,,,,,
1,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
5,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True